// Task 10 ============================================
/*  Дан массив b10 = [ [1,2,3], [3,4,6], [4,5,7], [8,9,3]]. С помощью filter переберите массив и создайте  b10_res, в который входят вложенные массивы содержащие цифру 3.  Возвратите b10_res. Действия должны запускаться при вызове функции t10. */

let b10 = [ [1,2,3], [3,4,6], [4,5,7], [8,9,3]]
let b10_res = [];

function t10() {
   
   b10_res = b10.filter(elem => {
        return elem.includes(3);
    });
return b10_res;
}

document.querySelector('.b-10').onclick = () => {
    console.log(t10());
};